---
title: DirectContext3DHandleSettings
classe: Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# DirectContext3DHandleSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `directContext3DHandleSettings.IsValidObject` | Boolean |
| `Boolean Visibility { get; set; }` | `directContext3DHandleSettings.Visibility` | Boolean |
| `Void Assign(DirectContext3DHandleSettings)` | `directContext3DHandleSettings.Assign(other)` | Void |
| `Void Dispose()` | `directContext3DHandleSettings.Dispose()` | Void |
| `Int32 GetTransparency()` | `directContext3DHandleSettings.GetTransparency()` | Int32 |
| `Boolean IsEqual(DirectContext3DHandleSettings)` | `directContext3DHandleSettings.IsEqual(other)` | Boolean |
| `Void SetTransparency(Int32)` | `directContext3DHandleSettings.SetTransparency(transparency)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```